/* Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
M = 1; N = 5. -> ""1, 2, 3, 4, 5""
M = 4; N = 8. -> ""4, 5, 6, 7, 8""
*/

int m = 12;
int n = 32;

for (int i = 0; i <= ((n-m) + i); i++)
{
    Console.Write($"{m, 3}");
    m = m + 1;
}
