/* Написать программу масштабирования фигуры */

// Предположим, что мультипликатор равен 2. В дальнейшем для масштабирования фигуры будем использовать этот мультипликатор для создания копии исходной фигуры (далее её масштабирования вдвое) и вывода её на экран

Console.Clear();

string describe = "Это шестиугольник (вершины фигуры): "; // ввод дополнительной переменной на случай, если нужно будет реализовать алгоритм для треугольника, квадрата, десятиугольника или другой фигуры
Console.WriteLine($"{describe}");

int[,] figureBeforeMultiplied =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [0, 0], [0, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [1, 0], [1, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [2, 0], [2, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [3, 0], [3, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [4, 0], [4, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [5, 0], [5, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [6, 0], [6, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [7, 0], [7, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [8, 0], [8, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [9, 0], [9, 1]
}; // объявление массива, заполненного нулями для его последующего наполнения произвольно заданными точками (вершинами фигуры)

void fillFigureBeforeMultiplied(int[,] figureEmpty) // наполнение массива точками, иллюстрирующими вершины фигуры до масштабирования
{
    int xa = 2, ya = 3,
    xb = 0, yb = 5,
    xc = 2, yc = 7,
    xd = 9, yd = 7,
    xe = 11, ye = 5,
    xf = 9, yf = 3;
    figureEmpty[ya, xa] = 1; // значения x и y инвертируются для корректного отображения данных в массиве и вывода на экран фигуры, "растянутой" слева направо, а не "снизу вверх"
    figureEmpty[yb, xb] = 1;
    figureEmpty[yc, xc] = 1;
    figureEmpty[yd, xd] = 1;
    figureEmpty[ye, xe] = 1;
    figureEmpty[yf, xf] = 1;
    /* // неудачная попытка настроить автоматическое заполнение пространства внутри фигуры по логическим условиям
    xab = (xa + xb) / 2,
    xbc = (xb + xc) / 2,
    xcd = (xc + xd) / 2,
    xde = (xd + xe) / 2,
    xef = (xe + xf) / 2,
    xfa = (xf + xa) / 2,
    yac = (ya + yc) / 2,
    yfd = (yf + yd) / 2,
    ybe = (yb + ye) / 2,
    ybeaf = (ya + ybe) / 2;
    */
}

fillFigureBeforeMultiplied(figureBeforeMultiplied);

void printFigureBeforeMultiplied(int[,] figureFilled) // вывод на экран специальных символов, расположенных в заполненных "1" ячейках массива
{
    for (int i = 0; i < figureFilled.GetLength(0); i++)
    {
        for (int j = 0; j < figureFilled.GetLength(1); j++)
        {
            if (figureFilled[i, j] == 0) Console.Write(" ");
            else Console.Write("'");
        }
        Console.WriteLine();
    }
}

printFigureBeforeMultiplied(figureBeforeMultiplied);

int[,] figureAfterMultiplied =
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [0, 0], [0, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [1, 0], [1, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [2, 0], [2, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [3, 0], [3, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [4, 0], [4, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [5, 0], [5, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [6, 0], [6, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [7, 0], [7, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [8, 0], [8, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [9, 0], [9, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [10, 0], [10, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [11, 0], [11, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [12, 0], [12, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [13, 0], [13, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [14, 0], [14, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [15, 0], [15, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [16, 0], [16, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [17, 0], [17, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [18, 0], [18, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [19, 0], [19, 1]
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }, // [20, 0], [20, 1]
};

void multipleFigureToX2(int[,] figureFilled)
{
    {
        int xa = 4, ya = 6, // все значения, записанные в этих переменных получены из первого массива (не масштабированной фигуры) и умножены на 2
        xb = 0, yb = 10,
        xc = 4, yc = 14,
        xd = 18, yd = 14,
        xe = 22, ye = 10,
        xf = 18, yf = 6;
        figureFilled[ya, xa] = 1;
        figureFilled[yb, xb] = 1;
        figureFilled[yc, xc] = 1;
        figureFilled[yd, xd] = 1;
        figureFilled[ye, xe] = 1;
        figureFilled[yf, xf] = 1;
        /* // неудачная попытка настроить автоматическое заполнение пространства внутри масштабированной фигуры по логическим условиям
        xab = (xa + xb) / 2,
        xbc = (xb + xc) / 2,
        xcd = (xc + xd) / 2,
        xde = (xd + xe) / 2,
        xef = (xe + xf) / 2,
        xfa = (xf + xa) / 2,
        yac = (ya + yc) / 2,
        yfd = (yf + yd) / 2,
        ybe = (yb + ye) / 2,
        ybeaf = (ya + ybe) / 2;
        */
    }
}

multipleFigureToX2(figureAfterMultiplied);

string describeMultiplication = "Это вершины шестиугольника после масштабирования: "; // ввод дополнительной переменной на случай, если нужно будет реализовать алгоритм для треугольника, квадрата, десятиугольника или другой фигуры
Console.WriteLine($"{describeMultiplication}"); // ввод дополнительной переменной на случай, если нужно будет реализовать алгоритм для треугольника, квадрата, десятиугольника или другой фигуры

void printFigureAfterMultiplied(int[,] figureMultiplied)
{
    for (int i = 0; i < figureMultiplied.GetLength(0); i++)
    {
        for (int j = 0; j < figureMultiplied.GetLength(1); j++)
        {
            if (figureMultiplied[i, j] == 0) Console.Write(" ");
            else Console.Write("'");
        }
        Console.WriteLine();
    }
}

printFigureAfterMultiplied(figureAfterMultiplied);