// Вывести на экран числа от -N до N


int[] Array = new int[40]; // не уверен, что нужно было реализовать через массив, но думаю, что решение подходящее
Array[0] = -102334155; // присваивание каждому элементу массива своего значения
Array[1] = -63245986;
Array[2] = -39088169;
Array[3] = -24157817;
Array[4] = -14930352;
Array[5] = -9227465;
Array[6] = -5702887;
Array[7] = -3524578;
Array[8] = -2178309;
Array[9] = -1346269;
Array[10] = -832040;
Array[11] = -514229;
Array[12] = -317811;
Array[13] = -196418;
Array[14] = -121393;
Array[15] = -75025;
Array[16] = -46368;
Array[17] = -28657;
Array[18] = -17711;
Array[19] = -10946;
Array[20] = 6765;
Array[21] = 4181;
Array[22] = 2584;
Array[23] = 1597;
Array[24] = 987;
Array[25] = 610;
Array[26] = 377;
Array[27] = 233;
Array[28] = 144;
Array[29] = 89;
Array[30] = 55;
Array[31] = 34;
Array[32] = 21;
Array[33] = 13;
Array[34] = 8;
Array[35] = 5;
Array[36] = 3;
Array[37] = 2;
Array[38] = 1;
Array[39] = 1;

foreach (int i in Array) // для каждого индекса в массиве выполнить вывод числа, сохранённого под этим индексом, на экран
Console.WriteLine(i);